export function entryMsg() {
  return `
Вітаю!
Я медичний бот, який допоможе підготувати все необхідне перед консультацією з лікарем.

Та спочатку кілька слів про умови користування:
- Обираєте підходящий Вам пакет послуг і натискаєте кнопку «Замовити»;
- Здійснюєте оплату онлайн і вирішуєте який формат спілкування Вам найбільш комфортний (текстові повідомлення в особистому чаті з лікарем, аудіодзвінок в Telegram, WhatsApp, відеоконференція в Google Meet);
- Якщо Вам необхідна відеоконсультація – бронюєте часовий слот у календарі, доступ до якого також з’явиться після оплати.

Час обробки запиту залежить від кількості консультацій, але не перевищуватиме одну добу.
Ваше спілкування з лікарем є суто конфіденційним і ні за яких обставин, крім випадків, передбачених чинним законодавством України, не стане надбанням третіх осіб (TODO посилання на документ «Умови конфіденційності»).
ВАЖЛИВО! Згідно з [наказом МОЗУ від 19.10.2015 № 681](https://zakon.rada.gov.ua/laws/show/z1400-15), лікар надає консультації рекомендаційного характеру і після консультації не виписує електронний рецепт на рецептурні препарати, бо первинно пацієнт має отримати очний огляд лікаря.
`;
}
