export function entryMessage() {
  return (
    'Привіт! Це медбот. \n' +
    'Перш ніж почати користуватися ботом, будь ласка, ознайомтесь з умовами користування. \n' +
    'Після ознайомлення з умовами, ви можете почати користуватися ботом. Для цього спочатку замовте послугу, натиснувши кнопку "Замовити"\n.' +
    'Після замовлення послуги потрібно здійснити оплату. Після оплати ви зможете відразу почати спілкуватися з лікарем через чат.\n' +
    'Якщо вам потрібно назначити зустріч, ви також можете зробити це після оплати, обравши зручний час. Зустріч може відбутися в форматі відеоконференції в Google Meet або в текстовому форматі, в залежності від вашого вибору.\n' +
    'Якщо ви пишете лікарю, вона відповість вам протягом дня, так що будьте терплячі і чекайте відповіді після відправки вашого повідомлення.'
  );
}
