import type { Prisma } from '@prisma/client';

export const products: Array<Prisma.ProductUncheckedCreateInput> = [
  {
    name: 'Індивідуальна консультація',
    description: 'текстова в повідомленнях в ТГ',
    price: 500,
    memberQty: 1,
    subscriptionDuration: 0,
  },
  {
    name: 'Індивідуальна консультація',
    description: 'аудіо/відео дзвінок',
    price: 650,
    memberQty: 1,
    subscriptionDuration: 0,
  },
  {
    name: 'Індивідуальна підписка «Лікар на зв’язку»',
    description:
      '-  Ведення та корекція дообстежень, призначень протягом 6 місяців від первинного звернення;\n-  Всі повторні консультації в цей час входять у вартість пакету;\n-  Корекція програми реабілітації протягом обраного періоду;',
    price: 3000,
    memberQty: 1,
    subscriptionDuration: 6,
  },
  {
    name: 'Індивідуальна підписка «Лікар на зв’язку»',
    description:
      '-  Ведення та корекція дообстежень, призначень протягом 6 місяців від первинного звернення;\n-  Всі повторні консультації в цей час входять у вартість пакету;\n-  Корекція програми реабілітації протягом обраного періоду;',
    price: 5500,
    memberQty: 1,
    subscriptionDuration: 12,
  },
  {
    name: 'Пакет послуг «Здоров’я родини»',
    description: '4 особи по 1 первинній консультації кожному',
    price: 1500,
    memberQty: 4,
    subscriptionDuration: 0,
  },
  {
    name: 'Пакет послуг «Здоров’я родини»',
    description:
      'Сімейна підписка на 4 особи. повторні консультації на обраний період, корекція дообстежень, плану лікування за потреби',
    price: 4500,
    memberQty: 4,
    subscriptionDuration: 6,
  },
  {
    name: 'Пакет послуг «Здоров’я родини»',
    description:
      'Сімейна підписка на 4 особи. повторні консультації на обраний період, корекція дообстежень, плану лікування за потреби',
    price: 8000,
    memberQty: 4,
    subscriptionDuration: 12,
  },
  {
    name: 'Пакет «Людською мовою»',
    description:
      '-  Роз’яснення дообстежень, інтерпретація результатів аналізів;\n-  Розробка поглиблених дообстежень за необхідності;',
    price: 500,
    memberQty: 1,
    subscriptionDuration: 0,
  },
  {
    name: 'Пакет «Профілактичний»',
    description:
      'Індивідуальний підбір аналізів, дообстежень для щорічного чек-апу стану здоров’я з подальшою їх трактовкою.',
    price: 700,
    memberQty: 1,
    subscriptionDuration: 0,
  },
];
